# vsoStateGetLayrChng

## Description
```pascal
FUNCTION vsoStateGetLayrChng(
				hObj             : HANDLE;
				VAR outOldScale  : REAL;
				VAR outNewScale  : REAL;
				VAR outScaleText : BOOLEAN) : BOOLEAN;
```

```python

def vs.vsoStateGetLayrChng(hObj):
    return (BOOLEAN, outOldScale, outNewScale, outScaleText)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||
|outOldScale|REAL||
|outNewScale|REAL||
|outScaleText|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events